upwork-devs/faisal-adnan/Artillery/gw-conf.yml
config:
  target: 'https://glasswallsolutions.com'
  phases:
    - duration: 60
      arrivalRate: 1          
  defaults:
    headers:
      x-request-id: 'k8-traffic-generator'
  plugins:
    publish-metrics:
      - type: statsd
        host: 127.0.0.1
        port: 8125     
        prefix: artillery. 
scenarios:
  - flow:
    - log: "Open technology page"
    - get:
        url: "/technology"    
    - log: "Open products page"    
    - get:
        url: "/products"
    - log: "Open pricing page"    
    - get:
        url: "/pricing"
    - log: "Open resources page"    
    - get:
        url: "/resources"
    - log: "Open company page"    
    - get:
        url: "/company"